'''
Дано положительное действительное число X. Выведите его дробную часть.
'''

x = float(input())
x1 = int(x)
print(x - x1)
