'''
Задача «Часы - 3»
Условие
С начала суток часовая стрелка повернулась на угол в α градусов. Определите сколько полных часов, минут и секунд прошло с начала суток, то есть решите задачу, обратную задаче «Часы - 1». Запишите ответ в три переменные и выведите их на экран.
'''

'''
a = float(input())
# a = 16.6
h = a // 30  # 1 час - 30 градусов
m = (a % 30) * 2  # остаток минут свыше часа, 1 градус - 2 минуты
s = a % 
print(int(h), int(m), int(s))
'''