'''
Напишите программу, которая приветствует пользователя,
выводя слово Hello, введенное имя и знаки препинания по образцу:
'''
# n = input()
n = 'Harry'
print(f'Hello, {n}!')

# n = input()
n = 'Harry'
print('Hello,', ' ', n, '!', sep='')

print('Hello, ' + input() + '!')

