'''
Задача «Удаление символа»
Условие
Дана строка. Удалите из этой строки все символы @.
'''
s = input()
# s = '@W@E@E@E@R'
# s.replace('W', ' ')  # применение функции разобрать!
# s1 = s.replace('@', '')  # применение функции разобрать!
print(s.replace('@', ''))
# print(s1)
