'''
Напишите программу, которая считывает длины двух катетов
в прямоугольном треугольнике и выводит его площадь.
Каждое число записано в отдельной строке.

Числа b и h можно считывать так:
b = int(input())
Выводите результат через print()
'''
a = int(input())
h = int(input())
print(0.5 * a * h)
