'''
Даны два целых числа. Выведите значение наименьшего из них.
'''
n1 = int(input())
n2 = int(input())
if n1 < n2:
    print(n1)
else:
    print(n2)
