# 000562_04_ex03_def_vowels.py
# в развитие темы - написать программу, которая выводит количество гласных букв, в порядке возрастания частотности

l=list()
print('list')
print(l)

print('dict')
d=dict()
print(d)

s=set()
print('set')
print(s)

t=tuple()
print('tuple')
print(t)

