# Stepik001124InformPy10Clсh01p02st10C07
name = input()
year = input()
print("Имя", name, "подчеркивает тот факт, что вы нуждаетесь в любви и восхищении. Также", name,
      "показывает, что вы довольно самокритичны. Создается впечатление, что вы гордитесь тем, что мыслите независимо. Вы родились в",
      year,
      "году - это говорит мне о том, что вы не принимаете чужих утверждений на веру без доказательств. Да, человек, который родился в",
      year, "году, заключает в себе положительную энергетику.")
