'''
Напишите программу определения количества
вхождений фраз «ra» в слове «abrakadabra»
'''
str1="abrakadabra"
ustr='ra'
print(str1.count(ustr))