'''
Stepik001146PyBeginch02p02st04TASK01_20200605.py

Напишите программу, которая выводит на экран текст «Здравствуй, мир!» (без кавычек).
'''
print("Здравствуй, мир!")
