str1 = input()
# str1 = 'abc'
for i in range(len(str1)-1, -1, -1):
    print(str1[i])

'''
На вход программе подается одна строка. Напишите программу,
которая выводит в столбик элементы строки в обратном порядке.

Формат входных данных
На вход программе подается одна строка.

Формат выходных данных
Программа должна вывести в столбик элементы строки в обратном порядке.

Sample Input:

abc
Sample Output:

c
b
a
'''
