# ----------------------------
print('# локальные функции:')


def print_texas():
    birds = 5000
    print('В Техасе обитает', birds, 'птиц.')


print_texas()


def print_california():
    # print('В Калифорнии обитает', birds, 'птиц.')
    pass


# ide сразу выдает ошибку.

print()

# ----------------------------
print('# локальная переменная [birds]:')


def print_texas1():
    birds = 5000
    print('В Техасе обитает', birds, 'птиц.')


def print_california1():
    birds = 9000
    print('В Калифорнии обитает', birds, 'птиц.')


print_texas1()
print_california1()
# input()
print()

# ----------------------------
print('# Область действия параметрической переменной:')


def draw_box(height, width):
    for i in range(height):
        print('*' * width)


draw_box(10, 20)
# input()
print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')

print()

# ----------------------------
print('# ')
