'''
Арифметические операции
Напишите программу, в которой вычисляется сумма, разность и произведение двух целых чисел, введенных с клавиатуры.

Stepik001146PyBeginсh02p04st11TASK07_arithm_20200411.py
'''
num1 = int(input())
num2 = int(input())
print(num1, "+", num2, "=", num1 + num2)
print(num1, "-", num2, "=", num1 - num2)
print(num1, "*", num2, "=", num1 * num2)
