'''
Напишите программу, которая считывает строку-разделитель и три строки,
а затем выводит указанные строки через разделитель.

Stepik001146PyBeginсh02p03st06TASK02_20200411.py
'''

# div = input()
div = '***'

# str1 = input()
str1 = 'I'

# str2 = input()
str2 = 'like'

# str3 = input()
str3 = 'Python'

print(str1, str2, str3, sep=div, end='')
# print(str1 + div + str2 + div + str3)
