'''
Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке.
Первое число вводит пользователь, остальные числа вычисляются в программе.

Stepik001146PyBeginсh02p04st05TASK01_20200411.py
'''
num = int(input())
print(num)
print(num + 1)
print(num + 2)
