'''
Разделяй и властвуй
Напишите программу, которая считывает целое положительное число x и
выводит на экран последовательность чисел [...]
разделённых тремя черточками.
Условие: Stepik001146PyBeginсh02p04st13TASK09_div_imper

Stepik001146PyBeginсh02p04st13TASK09_div_imper_20200411.py
'''
num = int(input())
print(num, num * 2, num * 3, num * 4, num * 5, sep='---')
