'''
Куб
Напишите программу, вычисляющую объём куба и площадь его полной поверхности,
по введённому значению длины ребра.
Stepik001146PyBeginсh02p04st07TASK03_Cube_20200411.py
'''
a = int(input())
v = a * a * a
s = 6 * a * a
print("Объем =", v)
print("Площадь полной поверхности =", s)
