num1 = int(input())
for i in range(1, num1 + 1):
    for j in range(1, 10):
        print(f"{i} + {j} = {i + j}")
    print()
'''
Дано натуральное число (n≤ 9). Напишите программу, которая печатает таблицу сложения
 для всех чисел от 11 до nn в соответствии с примером.

Формат входных данных
На вход программе подается одно натуральное число.

Формат выходных данных
Программа должна вывести таблицу сложения для всех чисел от 1 до n.

Примечание. В конце строки может быть пробел.
'''