# Задача 1. Напишите программу, которая определяет, является ли заданное число трёхзначным.
num = int(input())
print(99 < num <= 999)
# совпало с предложенным

