str1 = input()
# str1 = '2514'
sum = 0
for i in str1:
    sum += int(i)
print(sum)
'''
Цифра 1
На вход программе подается одна строка состоящая из цифр.
Напишите программу, которая считает сумму цифр данной строки.

Формат входных данных
На вход программе подается одна строка состоящая из цифр.

Формат выходных данных
Программа должна вывести сумму цифр данной строки.
'''
