print()
# ---------------------
numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
for i in range(len(numbers)):  # вывод поэлементно, с использованием индексов.
    print(numbers[i])
print()
# ---------------------
numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

for num in numbers:  # вывод поэлементно, без использования индексов.
    print(num)
print()
# ---------------------
print('(num, end=' ')  # вывод на одной строке (можно просто в задания поместить + без пробела)')
numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
for num in numbers:
    print(num, end=' ')  # вывод на одной строке (можно просто в задания поместить + без пробела)
print()
print()
# ---------------------
print('(*numbers)  # распаковка списка')
numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(*numbers)  # распаковка списка
print()
# ---------------------
numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(*numbers, sep='\n')  # распаковка списка (каждый элемент на отдельной строке)
print()
# ---------------------
s = 'Python' # распаковка строк аналогично списку (представляет собой таблицу символов)
print(*s)
print()
print(*s, sep='\n')
print(*s, sep='***')


