'''
Напишите программу, которая выводит на экран текст «I***like***Python» (без кавычек).

Stepik001146PyBeginсh02p03st05TASK01_20200411.py
'''
print("I", "like", "Python", sep="***")