len_list = int(input())
list_num = list(range(1, len_list + 1))
print(list_num)
'''
Список чисел
На вход программе подается одно число n. Напишите программу, которая выводит список [1, 2, 3, ..., n].

Формат входных данных
На вход программе подается одно натуральное число.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Sample Input 1:

1
Sample Output 1:

[1]
Sample Input 2:

5
Sample Output 2:

[1, 2, 3, 4, 5]
Sample Input 3:

10
Sample Output 3:

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
'''
