'''

'''

# ----------------------------
print('Функции')

print()

# ----------------------------
print('прямоугольник 01')
print('*******')
print('*******')
print('*******')
print('*******')
print('*******')
print()

# ----------------------------
print('прямоугольник 02')
print('*' * 7)
print('*' * 7)
print('*' * 7)
print('*' * 7)
print('*' * 7)
print()

# ----------------------------
print('прямоугольник 03')
for _ in range(5):
    print('*' * 7)
print()

# ----------------------------
print('прямоугольник 04')

for _ in range(5):
    print('*' * 7)
print()

for _ in range(5):
    print('*' * 7)
print()

for _ in range(5):
    print('*' * 7)
print()

# ----------------------------
print('прямоугольник 05 (функция)')


def draw_box():
    for _ in range(5):
        print('*' * 7)


print()

# ----------------------------
print('прямоугольник 05 (функция): вызов фукнции')
draw_box()
print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()

# ----------------------------
print('# индексы (отрицательные)')

print()
