'''
Расстояние в метрах
Напишите программу, которая находит полное число метров по заданному числу сантиметров.

Stepik001146PyBeginсh02p05st07TASK02_meters_20200411.py
'''
num = int(input())
print(num // 100)
