'''
Stepik001146PyBeginch02p02st11TASK05_20200605.py

На вход программе подается строка текста – имя человека. Напишите программу,
которая выводит на экран приветствие в виде слова «Привет» (без кавычек),
после которого должна стоять запятая и пробел, а затем введенное имя.
'''

name = input()
print("Привет,", name)