'''
Напишите программу, которая приветствует пользователя, выводя слово «Привет» (без кавычек),
после которого должна стоять запятая и пробел, а затем введенное имя и восклицательный знак.

Stepik001146PyBeginсh02p03st07TASK03_20200411.py
'''
# name = input()
name = "Василий"
print("Привет,", name, end="!")
