'''
Следующее и предыдущее
Напишите программу, которая считывает целое число, после чего на экран
выводится следующее и предыдущее целое число с пояснительным текстом.

Stepik001146PyBeginсh02p04st09TASK05_next_20200411.py
'''
num = int(input())
print("Следующее за числом", num, "число:", num + 1)
print("Для числа", num, "предыдущее число:", num - 1)
