'''
Напишите программу вычисления значения функции по введеным целым значениям a и b.
Stepik001146PyBeginсh02p04st08TASK04_func - условие

Stepik001146PyBeginсh02p04st08TASK04_func_20200411.py
'''
a = int(input())
b = int(input())
print(3 * (a + b) * (a + b) * (a + b) + 275 * b * b - 127 * a - 41)
