'''
Сумма трёх чисел
Напишите программу, которая считывает три целых числа и
выводит на экран их сумму. Каждое число записано в отдельной строке.
Stepik001146PyBeginсh02p04st06TASK02_20200411.py
'''
num1 = int(input())
num2 = int(input())
num3 = int(input())
print(num3 + num2 + num1)
