'''
Напишите программу, которая выводит указанный треугольник, состоящий из звездочек (*).

Stepik001146PyBeginch02p02st07TASK04_20200605.py
'''
print("*")
print("**")
print("***")
print("****")
print("*****")
print("******")
print("*******")