num = int(input())
while num != -1:
    print('Квадрат вашего числа равен:', num * num)
    num = int(input())

print("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@")

# используем for
for i in range(101):
    print(i)

print("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@")

# используем while
i = 0
while i < 101:
    print(i)
    i += 1

print("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@")

# Напишем программу выводящую все числа кратные 3 используя цикл for и while:
# используем for
for i in range(0, 100, 3):
    print(i)

print("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@")

# используем while
i = 0
while i < 100:
    print(i)
    i += 3

print("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@")
# Считывание данных до стоп значения

text = input("начинай вводить значения, как закончишь, набери [stop]: ")
total = 0
while text != 'stop':
    num = int(text)
    total += num
    text = input()
print('Сумма чисел равна', total)

