'''
На вход программе подается строка текста – название футбольной команды.
Напишите программу, которая повторяет ее на экране со словами « - чемпион!» (без кавычек).

Stepik001146PyBeginch02p02st12TASK06_20200605.py
'''
name = input()
print (name,"- чемпион!")