s = 13
k = -5
d = s + 2  # 15
s = d  # 15
k = 2 * s  # 30
print(s + k + d)  # 15+30+15

a = 17 // (23 % 7)  # 17//2 = 8
b = 34 % a * 5 - 29 % 4 * 3  # 10 - 3 = 7
print(a * b)  # 56

# Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).
# Примечание. Высота и ширина прямоугольника равны 4 и 17 звёздочкам соответственно.
print("*" * 17)
print("*", end='')
print(" " * 15, end="")
print("*")
print("*", end='')
print(" " * 15, end="")
print("*")
print("*" * 17)

# Сумма квадратов VS квадрат суммы
# Sample Input 1:
# 3
# 2
# Sample Output 1:
# Квадрат суммы 3 и 2 равен 25
# Сумма квадратов 3 и 2 равна 13
a = int(input())
b = int(input())
print("Квадрат суммы", a, "и", b, "равен", (a + b) ** 2)
print("Сумма квадратов", a, "и", b, "равна", (a ** 2 + b ** 2))

# Большое число
# Sample Input:
# 9
# 29
# 7
# 27
# Sample Output:
# 4710194409608608369201743232
a = int(input())
b = int(input())
c = int(input())
d = int(input())
print(a ** b + c ** d)

# Размножение n-ок
a = int(input())
# print(a, str(a) * 2, str(a) * 3, sep=" + ", end=" = ")
print(a + int(str(a) * 2) + int(str(a) * 3))
