foo = "Привет!"
print(foo[0])
print(foo[-2])
i = 0
print(foo[i], foo[i + 1]) # индекс можно указать с помощью арифметического выражения