'''
Напишите программу, которая выводит на экран три числа: 333, 334 и 335.
Сначала каждое из этих чисел нужно напечатать в отдельной строке
(ваша программа напечатает три строки)
В четвертой строке необходимо вывести все эти числа, разделяя их пробелами.
Примечание: при решении этой задачи нельзя использовать кавычки.
Sample Input:

Sample Output:

333
334
335
333 334 335
'''
print('333')
print('334')
print('335')
print('333 ', end='')
print('334 ', end='')
print('335 ', end='')
