'''
Напишите программу, которая объявляет 5 переменных -
s1, s2, s3, s4 и s5 и присваивает им значения
"Мы", "изучаем", "язык", "программирования", "Python" соответственно.

После инициализации переменных программа должна напечатать
значения этих переменных в одной строке через пробел в обратном порядке.
Таким образом, сначала будет напечатано значение переменной s5, потом s4 и так далее до s1.

Sample Input:

Sample Output:

Python программирования язык изучаем Мы
'''
s1 = 'Мы'
s2 = 'изучаем'
s3 = 'язык'
s4 = 'программирования'
s5 = 'Python'
print(s5, s4, s3, s2, s1)
