'''
Напишите программу, которая считывает два целых числа и выводит на экран сумму этих чисел

Sample Input 1:

37
81
Sample Output 1:

118
Sample Input 2:

100
50
Sample Output 2:

150
'''
num1 = int(input())
num2 = int(input())
print(num1 + num2)
