'''
Напишите программу, которая выводит на экран 5 слов, разделяя их пробелами:
"Мы", "изучаем", "язык", "программирования", "Python" (каждое слово выводится без кавычек)
Примечание: при решении этой задачи нельзя размещать пробелы внутри кавычек
'''
print('Мы', end=' ')
print('изучаем', end=' ')
print('язык', end=' ')
print('программирования', end=' ')
print('Python', end='')
