'''
Напишите программу, которая выводит на экран текст
"Мы изучаем язык программирования Python" (без кавычек),
печатая каждое слово в новой строке
'''
print('Мы')
print('изучаем')
print('язык')
print('программирования')
print('Python')
