'''
Напишите программу, которая считывает две строки и выводит на экран конкатенацию этих строк

Примечание: конкатенация - операция "сложения" двух строк

Sample Input 1:

Язык программирования
Python
Sample Output 1:

Язык программированияPython
Sample Input 2:

37
81
Sample Output 2:

3781
'''
s1, s2 = input(), input()
print(s1 + s2)
