'''
На вход программе подаются две цифры. Напишите программу, которая получает из этих цифр двузначное число и выводит его на экран

Примечание: перед выводом на экран необходимо сохранить это число в переменную

Sample Input 1:

7
8
Sample Output 1:

78
Sample Input 2:

3
5
Sample Output 2:

35
'''
n1, n2 = input(), input()
print(int(n1 + n2))
