'''
Напишите программу, которая выводит на экран текст
"Мы изучаем язык программирования Python" (без кавычек)
'''
print('Мы изучаем язык программирования Python')