'''
Напишите программу, которая считывает два целых числа и выводит на экран в четырех различных строках сумму, разность, произведение и частное этих чисел, представляя результат в виде уравнений (см. примеры)

Sample Input 1:

9
3
Sample Output 1:

9 + 3 = 12
9 - 3 = 6
9 * 3 = 27
9 / 3 = 3.0
Sample Input 2:

12
-3
Sample Output 2:

12 + -3 = 9
12 - -3 = 15
12 * -3 = -36
12 / -3 = -4.0
'''
num1, num2 = int(input()), int(input())
print(f'{num1} + {num2} = {num1 + num2}')
print(f'{num1} - {num2} = {num1 - num2}')
print(f'{num1} * {num2} = {num1 * num2}')
print(f'{num1} / {num2} = {num1 / num2}')
