'''
Напишите программу, которая объявляет три переменных:
"name", "price" и "number" и присваивает им значения: "хлеб", 29.99 и 3.

После инициализации переменных программа должна напечатать
значения этих переменных (каждое с новой строки)

Sample Input:

Sample Output:

хлеб
29.99
3
'''
name = 'хлеб'
price = 29.99
number = 3
print(name, price, number, sep='\n') # больше упражнений на параметры [print]
