'''
Напишите программу, которая объявляет переменную "s" и присваивает ей значение
"Мы изучаем язык программирования Python".
После инициализации переменной программа должна напечатать значение этой переменной.
Sample Input:
Sample Output:
Мы изучаем язык программирования Python
'''
s = 'Мы изучаем язык программирования Python'
print(s)
