'''
Антон любит кататься на общественном транспорте и собирать счастливые билеты. Антон живет в крупном городе, в котором билеты имеют шестизначные номера формата ХХХХХХ. Счастливым называется билет, у которого сумма первых трёх цифр равна сумме последних трёх цифр.

Формат входных данных

Натуральное шестизначное число - номер билета, который достался Антону сегодня

Формат выходных данных

Выведите на экран "Ура, повезло!", если Антону достался счастливый билет и "Повезет в следующий раз" в противном случае

Sample Input 1:

123123
Sample Output 1:

Ура, повезло!
Sample Input 2:

123456
Sample Output 2:

Повезет в следующий раз
'''

