'''
Напишите программу, которая считывает три строки
и выводит на экран эти же строки в одной строке, разделяя их пробелами.
---
Sample Input 1:
Мы
любим
Python
Sample Output 1:
Мы любим Python
Sample Input 2:
аша
888
Masha
Sample Output 2:
Даша 888 Masha
'''
s1, s2, s3 = input(), input(), input(),
print(s1, s2, s3)
