'''
Напишите программу, которая считывает строку, введенную пользователем,
и печатает эту же строку на экране
---
Sample Input 1:
Мы изучаем язык программирования Python
Sample Output 1:
Мы изучаем язык программирования Python
Sample Input 2:
Python
Sample Output 2:
Python
'''
str1 = input()
print(str1)
