'''
Напишите программу, которая считывает строку, введенную пользователем, и трижды печатает эту же строку на экране каждый раз с новой строки (будет напечатано три строки).

Sample Input 1:

Мы изучаем язык программирования Python
Sample Output 1:

Мы изучаем язык программирования Python
Мы изучаем язык программирования Python
Мы изучаем язык программирования Python
Sample Input 2:

Python
Sample Output 2:

Python
Python
Python
'''
str1 = input()
print(str1)
print(str1)
print(str1)
