'''
Напишите программу, которая объявляет переменную: "name" и присваивает ей значение "Python".
Программа должна напечатать в одну строку, разделяя пробелами:
Строку "name"
Значение переменной "name"
Число 3
Число 8.5
Sample Input:

Sample Output:

name Python 3 8.5
'''
name = 'Python'
print('name', name, 3, 8.5)
