'''
Напишите программу, которая считает строку и положительное число N, а после этого напечатает введенную строку N раз

Sample Input 1:

Python
3
Sample Output 1:

PythonPythonPython
Sample Input 2:

10000
5
Sample Output 2:

1000010000100001000010000
'''
s1 = input()
num1 = int(input())
print(s1 * num1)
