#000560_02_07_task03_lists.py
#Создайте список и выведите на экран его третий элемент
things = [1,2,3]
print (things[2])
#обратить внимание, что третий элемент имеет индекс 2(!)