'''
Даны два числа. Напиши программу, которая найдет их среднее арифметическое. На вход программе поступает два числа a и b, каждое из которых не превышает 10000. Программа должна вывести среднее арифметическое чисел a и b.

Sample Input 1:

1
2
Sample Output 1:

1.5
Sample Input 2:

3.5
1.5
Sample Output 2:

2.5
'''
a = float(input())
b = float(input())
print((a + b) / 2)
