'''
Требуется написать программу, которая будет принимать на вход 1 или 0, и выдавать на вывод соответственно True или False.

Sample Input 1:

1
Sample Output 1:

True
Sample Input 2:

0
Sample Output 2:

False
'''
s = int(input())
if s == 0:
    print(False)
if s == 1:
    print(True)
