'''
Stepik001132ITclassPyсh01p03st03TASK02__20200610.py

Даны три переменные, напиши такую программу, которая используя эти
переменные выведет текст: "Дважды два = четыре" без кавычек.
'''
b = 'два'
a = 'Дважды'
c = 'четыре'
print("{} {} = {}".format(a, b, c))