'''
вещественные числа неточны
'''
print(0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1)

# разделение целой и вещественной части
# a, b = input('Введите вещественное число:').split('.')
a, b = '12.4'.split('.')
print(a)
print(b)
# изменение

# a, b = input('Введите вещественное число:').split('.')
a, b = '015.01'.split('.')
# Введите вещественное число: 015.01
# a = '015'
# b = '01'
print(a)
print(b)


f = 15.01
print(str(f).replace('.', ','))

a = 15.0115011501
print(f'{a:.{2}f}') # точность вывода

# изменение
a = 15.0115011501
print(f'{a:.{5}f}')
# 15.01150