'''
Stepik001132ITclassPyсh01p03st04TASK03__20200610.py

Дан мем - "не знаю", нужно написать программу, которая распечатает этот мем, столько раз, сколько укажет пользователь.
¯\_(ツ)_/¯

'''
mem = '¯\_(ツ)_/¯'
num1 = int(input())
print((mem+' ') * num1)
