print(3 % 4)
print(1 % 2)
print(7 // 3)  # в задания, прекрасный пример.
print(4 // 8)  # давать в задания! прекрасный пример.
print(10 % 2)  # тоже хороший пример, давать в задания.
print(50 // 3)
print("От веревки в 50 метров можно отрезать 3 метровые куски", 50 // 3, "раз.")
print("Если от 365 постоянно забирать 7, то в конце останется", 365 % 7)
print(1905 // 100, "м.")
print(100000 // 60 * 60, "ч.")  # добавитьв задания, важно! порядок действий
print(100000 // (60 * 60), "ч.")  # добавитьв задания, важно! порядок действий

a = 4
b = 3
print("Посчитаем", a ** b)

speed = 0.0014
distance = 5.04
print("Необходимое время", distance / speed, "с.")

distance = 25.2
time = 90
print("Скорость самолета", distance * 1000 / time, "м/с.")

speed = 660
distance = 825
print("Время полета", distance / speed, "с.")
