# Почувствовав себя увереннее, Вася решил рассмотреть задачи с самыми распространенными ошибками.
# Судя по комментариям его одноклассников из Яндекс Лицея, у всех возникают проблемы с
# одновременным использованием ' и ".  Он решил испытать свои силы и вывести на экран фразу
# Моя первая программа напечатала "Привет, Яндекс!" :)
#
# Sample Input:
# Sample Output:
# Моя первая программа напечатала "Привет, Яндекс!" :)

# >>> print("Моя первая программа напечатала "Привет, Яндекс!" :)")
print('Моя первая программа напечатала "Привет, Яндекс!" :)')

