# Напишите программу, выводящую на экран фразу "Московская правда" - старейшая городская газета
# Sample Input:
# Sample Output:
# "Московская правда" - старейшая городская газета
print('"Московская правда" - старейшая городская газета')