# Напишите программу, которая выводит на экран фразу
# [You're breath taking!]
#
# Sample Input:
# Sample Output:
# You're breath taking!
print("You're breath taking!")
